Revit 2024 API
IPointSetIterator.ReadPoints Method
 Implement this method to fill the provided buffer with points up to the number of maximum points for which the buffer was allocated.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
int ReadPoints(
	IntPtr buffer,
	int bufferSize
)
Visual Basic
Function ReadPoints ( _
	buffer As IntPtr, _
	bufferSize As Integer _
) As Integer
Visual C++
int ReadPoints(
	IntPtr buffer,
	int bufferSize
)
Parameters
buffer
Type: System.IntPtr
 Memory buffer into which the points should be written. The buffer was allocated by Revit and it is guaranteed to be valid for the duration of the call.
bufferSize
Type: System.Int32
 The maximum number of CloudPoint objects that may be copied into the buffer.
Return Value
 The actual number of CloudPoint objects placed in the buffer (can be less than the length of the buffer). If there are no more points available, return 0.
See Also
IPointSetIterator Interface
Autodesk.Revit.DB.PointClouds Namespace